<?php

$lang = [
    'local' => 'زبان',
    'lang' => 'زبان',
    'fa' => 'فارسی',
    'ar' => 'العربیه',
    'en' => 'English',
    // ******************* Public words ************************
    'title' => "عنوان",
    'comment' => "توضیحات",
    'user' => 'کاربر',
    'name' => "نام",
    'family' => "فامیلی",
    'username' => "نام کاربری",
    'password' => "رمز عبور",
    'password_repeat' => "تکرار رمز عبور",
    'login' => "ورود",
    'logout' => "خروج",
    'register' => "ثبت نام",
    'forget_password' => "فراموشی رمز عبور",

    // ******************* Public Form words ************************
    'list' => "فهرست",
    'new' => "جدید",
    'save' => "ذخیره",
    'edit' => "ویرایش",
    'delete' => "حذف",
    'view' => 'مشاهده',
    'send' => "ارسال اطلاعات",
    'operation' => "عملیات",
    'action' => "فعالیت",
    'insert_date' => "تاریخ ثبت",
    'groups' => 'گروه ها',
    'group' => 'گروه',
    'new_group' => 'گروه جدید',
    'link' => 'لینک',
    'upload' => 'آپلود',
    'download' => 'دانلود',
    'file' => 'فایل',
    'image' => 'تصویر',
    'save_message' => 'داده ها با موفقیت ذخیره گردید',
    // ******************* Public Form words ************************
    'grid_loading' => 'در حال دریافت اطلاعات ...',
    'no_data' => 'داده ای یافت نشد',
    'error message' => 'پیغام خطا',
    'error-401' => 'عدم دسترسی!!',
    'error-500' => 'خطای سرور!!',
    'getinfo_error' => 'خطایی در دریافت اطلاعات به وجود آمده است، لطفا مجددا تلاش بفرمائید.',
    
    // ******************* SAdmin info *************************
    'systems' => 'سامانه ها',
    'system' => 'سامانه',
    'menus' => 'منوها',
    'menu' => 'منو',
    'roles' => 'نقش ها',
    'role' => 'نقش',
    'permisions' => 'دسترسی ها',
    'permision' => 'دسترسی',
    
    // 'title_ar' => 'عنوان به عربی',
    // 'title_en' => 'عنوان به انگلیسی',

];

return $lang;