<?php

namespace Database\Seeders\Edu;

use Illuminate\Database\Seeder;
use Models\Edu\Course;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            [
                "code"=>"15356796",
                "title"=>"آموزش فلسفه",
                "category_id"=>1,
                "thumbnail"=>"1.png",
                "system_id"=>1,
                "description"=>"پس از پیروزی انقلاب اسلامی ایران و با گسترش اسلام ناب محمدی در جهان، افق های جدید فراروی دانشمندان مسلمان ایرانی قرار گرفت و آنان در مواجهه با دیگر فرهنگ ها با پرسش های جدیدی روبرو شدند. امواج مباحث و شبهات جدید باعث تحریک و تکاپوی بی سابقه ای در حوزه های علمیه، دانشگاه ها و مراکز علمی شد. بی تردید مطالعه دین یکی از جدی ترین مباحثی است که امروزه مورد توجه محافل علمی جهان قرار گرفته است. مطرح شدن مباحثی همچون عقل و وحی، علم و دین، تجربه دینی و ده ها موضوع ومسأله دیگری که امروزه در جای جای دنیا و مجامع علمی داخلی و خارجی مورد بحث هستند، ساماندهی و اجرای دوره های تکمیلی دین شناسی و فلسفه دین را ضروری تر می نماید.",
               
            ],
            [
                "code"=>"12536796",
                "title"=>"زبان انگلیسی",
                "category_id"=>2,
                "thumbnail"=>"3.png",
                "system_id"=>2,
                "description"=>"ساختن خانه ای از چوب، بدون میخ، پیچ یا چسب را تصور کنید. سازه ها چطور می توانند کنار هم قرار بگیرند؟ قطعا نمی توانند! تمام قطعات از هم می پاشند. چنین وضعیتی زمانی اتفاق می افتد که بخواهید بدون داشتن دانش درستی از گرامر، زبان انگلیسی صحبت کنید. هر جمله فقط مجموعه ای از کلمات خواهد بود!
                گرامر زبان انگلیسی یکی از مهم ترین عناصر مطالعه زبان است. متاسفانه، می تواند یکی از پیچیده ترین و سخت ترین قسمت های یادگیری هم باشد.
                گرامر سیستمی است که یک زبان را سازمان می‌دهد. قواعد گرامری مانند چراغ‌های راهنمایی و قوانین جاده‌ای هستند. علائم و قوانین ترافیکی باعث در حرکت بودن ماشین‌ها بدون تصادف به سمت مقصدشان هستند. در مورد زبان نیز، گرامر ما را در مسیر درست به سمت مقصدمان که همان ارتباط واضح است، نگاه می‌دارد.
                گرامر صحیح، کلید اصلی روان، سلیس و با اعتماد به نفس صحبت کردن به زبان انگلیسی است. دانستن گرامر زبان انگلیسی به شما کمک می کند از خطاهایی که باعث می شود جملات شما به نظر بومیان انگلیسی زبان عجیب و غیرقابل فهم به نظر برسد، جلوگیری کنید.
                دوره زبان عمومی پیش رو از جمله کاملترین و دقیق ترین دوره های آموزشی گرامر زبان انگلیسی موجود در بین دوره های آکادمیک و مجازی می باشد. این دوره در 24 جلسه ارائه می گردد. ",
               
            ],
            [
                "code"=>"123526796",
                "title"=>"مسائل جدید کلامی",
                "category_id"=>3,
                "thumbnail"=>"4.png",
                "system_id"=>1,
                "description"=>"با توجه به شکل گیری گونه های مختلف حکومت اسلامی از دوران پیامبر اسلام (ص) تا به امروز و نظر به نقش عمیق و گسترده اندیشه سیاسی و شاخه های آن (نظیر فلسفه سیاسی) در فرهنگ و تمدن اسلامی، شناخت اندیشه سیاسی در اسلام به ویژه از منظر کتاب، سنت و بزرگان این حوزه ضرورت می یابد. از اینرو سپری کردن این رشته تلاشی است جهت تربیت متخصصانی که با شناخت مفاهیم سیاسی اسلام و آشنایی با دیدگاه بزرگان دینی، از تحلیل عمیقی در آموزش و پژوهش و سمتهای اجرایی برخوردار شوند.",
               
            ],
            [
                "code"=>"993456796",
                "title"=>"پوشش در اسلام",
                "category_id"=>4,
                "thumbnail"=>"2.png",
                "system_id"=>2,
                "description"=>"علوم تربیتی شاخه‌ای میان‌رشته‌ای است که با بهره‌گیری از یافته‌های علوم مختلف ازجمله روانشناسی، جامعه‌شناسی، اقتصاد و داده‌های فرهنگی ـ دینی ـ فلسفی، با تأکید بر روش‌های علم و فلسفه و با هدف کاربرد این علوم در تربیت انسان ایجاد گردیده است. هدف از فراگیری این رشته آشنایی دانشجو با شیوه های تعلیم و تربیت و اصول آن، آشنایی با شیوه ها و تکنولوژی آموزشی، شیوه‌های تحقیق در مسائل تربیتی و ... است. ",
               
            ],
          
            
           
        ];
        foreach($items as $item)
        {
            Course::create($item);
        }
        // Course::factory()->count(10)->create();
    }
}
