<?php

namespace Database\Seeders\Base;

use Illuminate\Database\Seeder;
use Models\Base\System;

class SystemSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            [
                "title"=>"سامانه سدف",
                "api_key"=>"123456796",
                "ip"=>"127.0.0.1",
                "domain"=>"www.sadaf.ir",
                "photo"=>"sadaf.png",
                "description"=>" سيستم جامع خدمات آموزش دانشگاه ها و موسسات آموزش عالي كه درسال هزاروسيصدوهفتاد وچهار طراحي و با نام سيستم جامع آموزشي و تحصيلي نصر معروف شد، در چندين دانشگاه و موسسه آموزش عالي در اقصي نقاط كشور مورد استفاده قرار گرفت. اين سيستم در سال هشتا دودو توسط متخصصين اين شركت و با همكاري دانشگاه فردوسي مشهد و مجددا طراحي و با نام جديد سدف به صورت متن باز در اختيار جامعه دانشگاهي کشور قرار گرفت. کليه خدمات پشتيباني سيستم به اعتبار تفاهم نامه موجود بين مرکز کامپيوتر دانشگاه فردوسي مشهد و شرکت مهندسي داده پردازان معاصر به شرکت مهندسي داده.پردازان معاصر واگذار گرديده است . ",
               
            ],
            [
                "title"=>"سامانه گلستان",
                "api_key"=>"1234234567",
                "ip"=>"127.4.3.2",
                "domain"=>"www.golestan.ir",
                "photo"=>"golestan.png",
                "description"=>" سيستم جامع آموزش گلستان، در دانشگاه صنعتي اصفهان و در راستاي اجراي مکانيزه کليه امور اجرايي آموزشي دانشگاه در کليه سطوح، طراحي و پياده سازي شده است. تجزيه و تحليل، طراحي، پياده سازي، تست و تحويل اين سيستم از اسفند ماه 1379 شروع و در تابستان 1382 به پايان رسيده است. در مدت 30 ماه کارشناسان مختلف با همکاري مديريت محترم دانشگاه صنعتي اصفهان در طرح مذکور فعاليت طاقت فرسايي را دنبال کرده‌اند. هم اکنون سيستم گلستان در کليه امور اجرايي آموزش دانشگاه مورد استفاده قرار مي گيرد. همچنین در سال‌های اخیر بخش پژوهش آن هم فعال شده و هم‌اکنون بیشتر فعالیت‌های پژوهشی اساتید از طریق آن صورت می‌گیرد. ",
               
            ],
            
           
        ];
        foreach($items as $item)
        {
            System::create($item);
        }
    }
}
