<?php
    return [
        // ******************* login Admin ************************
        'panel' => 'لوحة المستخدم',
        'postNeedCheck' => 'الرسائل التي تحتاج إلى مراجعة',
        'result' => 'عرض النتائج',
        'needCheck' => 'المحادثات غير المراجعة',
        'inbox' => 'إرسال الأبحاث',
        'online_archives' => 'أرشيف الفصول الدراسية عبر الإنترنت',
        'online_past_archives' => 'أرشيف الفصول الدراسية عبر الإنترنت للسنوات السابقة',
        'viewResume' => 'عرض السيرة الذاتية',
        'editProfile' => 'تعديل الملف الشخصي',
    ];
?>
