<?php
    return [
        // ******************* login Admin ************************
        'panel' => 'لوحة المستخدم',
        'postNeedCheck' => 'الرسائل تحتاج إلى مراجعة',
        'result' => 'عرض النتائج',
        'needCheck' => 'المحادثات غير المراجعة',
        'inbox' => 'إرسال التحقیقات',
        'online_archives' => 'أرشيف الحصص الاونلاین',
        'online_past_archives' => 'أرشيف الحصص الاونلاین في السنوات الماضية',
        'viewResume' => 'عرض السيرة الذاتية',
        'editProfile' => 'تعديل الملف الشخصي',
    ];
?>
