<?php
return [
    // ******************* login Admin ************************
    'title_main' => 'IKVU',
    'title_sub' => ' (LMS)',
    'text_main1' => ' الدخول إلى المنصة التعليمية الافتراضية',
    'text_main2' => 'فرصة التعليم، فرصة لحياة الأفضل...',
    'text_sub' => '',
    'text_main_sm' => 'للدخول إلى «المنصة »، يرجى إدخال معلوماتك.',
    'remember_me' => 'حفظ',
    'terms_and_conditions' => 'الشروط والقوانین',
    'privacy' => 'سياسة الخصوصية',
    'and' => 'و',
    'acceptance_conditions' => 'من خلال الدخول، فإنك توافق على جميع الشروط والأحكام التالية.',
];
?>