<?php
return [
    // ******************* login Admin ************************
    'title_main' => 'IKVU',
    'title_sub' => ' (LMS)',
    'text_main1' => 'تسجيل الدخول إلى نظام التعليم الافتراضي',
    'text_main2' => 'فرصة التعليم، فرصة لحياة أفضل...',
    'text_sub' => '',
    'text_main_sm' => 'للدخول إلى "نظام التعليم الافتراضي"، يرجى إدخال معلوماتك.',
    'remember_me' => 'تذكرني',
    'terms_and_conditions' => 'الشروط والأحكام',
    'privacy' => 'سياسة الخصوصية',
    'and' => 'و',
    'acceptance_conditions' => 'عند الدخول، فإنك توافق على جميع الشروط والأحكام أدناه.',
];
?>
